Autodesk.Revit.DB.PointClouds.IPointCloudEngine
An interface that controls the behavior of the link from Revit to a custom Point Cloud Engine.
Remarks:
An instance of this interface should be created by the engine provider
and registered with the PointCloudEnginesRegistry. The engine may associated
with a particular file name extension during registration (for example,
Revit supplies a built-in engine for working with files with the extension "rcs" or "rcp").
Alternatively, the engine may be associated with an identifier which is not expected
to the be the extension of a particular file.
Since:
2012